<a href="https://colab.research.google.com/github/sanahabib2409199/Python-Worshop/blob/master/Day4_case_study.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [3]:
import pandas as pd
import numpy as np
#Coding for importing csv files in Google colab
# Read csv file property_data.csv into a pandas dataframe
from google.colab import files
import io
uploaded = files.upload()
df = pd.read_csv(io.BytesIO(uploaded['property_data.csv~']))
# Take a look at the first few rows
print(df)

Saving property_data.csv~ to property_data (1).csv~
   ST_NUM    ST_NAME NUM_ROOMS OWN_OCCUPIED
0   104.0     LEXTON         2            Y
1   197.0   BERKELEY         3            N
2     NaN  WASHINTON         3            Y
3   201.0    TREMONT       NaN            N
4   203.0    TREMONT        na           12
5   205.0    TREMONT        --            Y
6     NaN      BLAZE         4          NaN
7   213.0      BLAZE         5            N
8   214.0      BLAZE         6            N

In [4]:
print (df['ST_NUM'])
print (df['ST_NUM'].isnull())
print(df['NUM_ROOMS'])
print(df['NUM_ROOMS'].isnull())

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    205.0
6      NaN
7    213.0
8    214.0
Name: ST_NUM, dtype: float64
0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool
0      2
1      3
2      3
3    NaN
4     na
5     --
6      4
7      5
8      6
Name: NUM_ROOMS, dtype: object
0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: NUM_ROOMS, dtype: bool

In [5]:
print(df['NUM_ROOMS'])
print(df['NUM_ROOMS'].isnull())

0      2
1      3
2      3
3    NaN
4     na
5     --
6      4
7      5
8      6
Name: NUM_ROOMS, dtype: object
0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: NUM_ROOMS, dtype: bool

In [6]:
cnt = 0
for row in df['NUM_ROOMS']: 
  try:
    int(row) 
  except ValueError:
    df.loc[cnt, 'NUM_ROOMS']=np.nan 
  cnt+=1
print(df['NUM_ROOMS'])
print(df['NUM_ROOMS'].isnull())

0      2
1      3
2      3
3    NaN
4    NaN
5    NaN
6      4
7      5
8      6
Name: NUM_ROOMS, dtype: object
0    False
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
Name: NUM_ROOMS, dtype: bool

In [7]:
print(df['OWN_OCCUPIED'])
print(df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      Y
3      N
4     12
5      Y
6    NaN
7      N
8      N
Name: OWN_OCCUPIED, dtype: object
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [8]:
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1
print(df['OWN_OCCUPIED'])
print(df['OWN_OCCUPIED'].isnull())

0      Y
1      N
2      Y
3      N
4    NaN
5      Y
6    NaN
7      N
8      N
Name: OWN_OCCUPIED, dtype: object
0    False
1    False
2    False
3    False
4     True
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [9]:
print(df.isnull().sum())
print('Total missing values')
print(sum(df.isnull().sum()))

ST_NUM          2
ST_NAME         0
NUM_ROOMS       3
OWN_OCCUPIED    2
dtype: int64
Total missing values
7

In [10]:
print(df['ST_NUM'].isnull().sum()) 
print(df['ST_NAME'].isnull().sum()) 
print(df['NUM_ROOMS'].isnull().sum()) 
print(df['OWN_OCCUPIED'].isnull().sum()) 
print(df.isnull().sum().sum())

2
0
3
2
7

In [11]:
df['ST_NUM'].fillna(125, inplace=True)
print('   ST_NUM')
print(df['ST_NUM'])

   ST_NUM
0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    205.0
6    125.0
7    213.0
8    214.0
Name: ST_NUM, dtype: float64

In [12]:
median = df['NUM_ROOMS'].median()
df['NUM_ROOMS'].fillna(median, inplace=True)
print(df['NUM_ROOMS'])

0      2
1      3
2      3
3    3.5
4    3.5
5    3.5
6      4
7      5
8      6
Name: NUM_ROOMS, dtype: object

In [13]:
print(df)

   ST_NUM    ST_NAME NUM_ROOMS OWN_OCCUPIED
0   104.0     LEXTON         2            Y
1   197.0   BERKELEY         3            N
2   125.0  WASHINTON         3            Y
3   201.0    TREMONT       3.5            N
4   203.0    TREMONT       3.5          NaN
5   205.0    TREMONT       3.5            Y
6   125.0      BLAZE         4          NaN
7   213.0      BLAZE         5            N
8   214.0      BLAZE         6            N

In [14]:
df['OWN_OCCUPIED'].value_counts().idxmax()

'N'

In [15]:
df

   ST_NUM    ST_NAME NUM_ROOMS OWN_OCCUPIED
0   104.0     LEXTON         2            Y
1   197.0   BERKELEY         3            N
2   125.0  WASHINTON         3            Y
3   201.0    TREMONT       3.5            N
4   203.0    TREMONT       3.5          NaN
5   205.0    TREMONT       3.5            Y
6   125.0      BLAZE         4          NaN
7   213.0      BLAZE         5            N
8   214.0      BLAZE         6            N

In [16]:
df['OWN_OCCUPIED'].value_counts()

N    4
Y    3
Name: OWN_OCCUPIED, dtype: int64

In [17]:
df['ST_NUM'].fillna(125)

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    205.0
6    125.0
7    213.0
8    214.0
Name: ST_NUM, dtype: float64

In [18]:
df

   ST_NUM    ST_NAME NUM_ROOMS OWN_OCCUPIED
0   104.0     LEXTON         2            Y
1   197.0   BERKELEY         3            N
2   125.0  WASHINTON         3            Y
3   201.0    TREMONT       3.5            N
4   203.0    TREMONT       3.5          NaN
5   205.0    TREMONT       3.5            Y
6   125.0      BLAZE         4          NaN
7   213.0      BLAZE         5            N
8   214.0      BLAZE         6            N

In [19]:
df['OWN_OCCUPIED'].fillna('N',inplace=True)
df

   ST_NUM    ST_NAME NUM_ROOMS OWN_OCCUPIED
0   104.0     LEXTON         2            Y
1   197.0   BERKELEY         3            N
2   125.0  WASHINTON         3            Y
3   201.0    TREMONT       3.5            N
4   203.0    TREMONT       3.5            N
5   205.0    TREMONT       3.5            Y
6   125.0      BLAZE         4            N
7   213.0      BLAZE         5            N
8   214.0      BLAZE         6            N